royal-mail-shipping-api/dan/soap-current-attempt-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.royalmailgroup.com/integration/core/V1" xmlns:ns2="http://www.royalmailgroup.com/api/ship/V2" xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><SOAP-ENV:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <wsse:UsernameToken wsu:Id="UsernameToken-D8D094FC22716E3EDE14258880881317">
        <wsse:Username>martin@audiovisualonline.co.ukAPI</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">90H+ZqGqJxXb/YNVQ/qNi50ilOU=</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">OTUxMDEw</wsse:Nonce>
        <wsu:Created>2016-05-25T13:40:45.782Z</wsu:Created>
    </wsse:UsernameToken>
</wsse:Security>
</SOAP-ENV:Header><SOAP-ENV:Body><ns2:createShipmentRequest><ns2:integrationHeader><ns1:dateTime>2016-05-25T13:40:45</ns1:dateTime><ns1:version>2</ns1:version><ns1:identification><ns1:applicationId>0127229000</ns1:applicationId><ns1:transactionId>832103982390</ns1:transactionId></ns1:identification></ns2:integrationHeader><ns2:requestedShipment><ns2:shipmentType><code>Delivery</code></ns2:shipmentType><ns2:serviceOccurrence>1</ns2:serviceOccurrence><ns2:serviceType><code>1</code></ns2:serviceType><ns2:serviceOffering><serviceOfferingCode><code>CRL</code></serviceOfferingCode></ns2:serviceOffering><ns2:serviceFormat><serviceFormatCode><code>P</code></serviceFormatCode></ns2:serviceFormat><ns2:shippingDate>2016-05-25</ns2:shippingDate><ns2:recipientContact><ns2:name>Steve Smith</ns2:name></ns2:recipientContact><ns2:recipientAddress><addressLine1>Line 2</addressLine1><postTown>Shropshire</postTown><postcode>EC1A 1BB</postcode></ns2:recipientAddress><ns2:items><ns2:item><ns2:numberOfItems>1</ns2:numberOfItems><ns2:weight><unitOfMeasure><unitOfMeasureCode><code>g</code></unitOfMeasureCode></unitOfMeasure><value>50</value></ns2:weight></ns2:item></ns2:items></ns2:requestedShipment></ns2:createShipmentRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
